---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.GetEnumerator
source: html/63cd2d0f-2e1c-23ed-df47-203e3cafdc61.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.